<details>
<summary>Execution result of "run plan --all" in "."</summary>

```terraform
01:26:58.893 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module ./management-account/eu-west-1/s3
- Module ./management-account/global-infra/organization-accounts
- Module ./playground-account/eu-west-1/s3
- Module ./test-account/eu-west-1/s3


01:26:59.111 INFO   [management-account/eu-west-1/s3] Downloading Terraform configurations from ./modules/s3 into ./management-account/eu-west-1/s3/.terragrunt-cache/6O7bSTWfYv7WPnJvTEak2cevHGQ/p0hmT_yU9GfVIbcsvydhmNhIJWg
01:26:59.149 INFO   [playground-account/eu-west-1/s3] Downloading Terraform configurations from ./modules/s3 into ./playground-account/eu-west-1/s3/.terragrunt-cache/Ife-siSQSkZudNuf1ioRzK__ydI/p0hmT_yU9GfVIbcsvydhmNhIJWg
01:26:59.157 INFO   [test-account/eu-west-1/s3] Downloading Terraform configurations from ./modules/s3 into ./test-account/eu-west-1/s3/.terragrunt-cache/FIgbXJVdUJAkmsa6YIf24Zbjalw/p0hmT_yU9GfVIbcsvydhmNhIJWg
01:26:59.193 INFO   [management-account/global-infra/organization-accounts] Downloading Terraform configurations from ./modules/organization-account into ./management-account/global-infra/organization-accounts/.terragrunt-cache/3XLPvzLN2Hf8668drqHKYhDUbDk/Yycl6dC0BtLQ-XFNjTw2ySiFaUQ
01:26:59.734 INFO   [playground-account/eu-west-1/s3] terraform: Initializing the backend...
01:26:59.734 INFO   [management-account/eu-west-1/s3] terraform: Initializing the backend...
01:26:59.736 INFO   [management-account/global-infra/organization-accounts] terraform: Initializing the backend...
01:26:59.737 INFO   [test-account/eu-west-1/s3] terraform: Initializing the backend...
01:27:00.785 INFO   [management-account/eu-west-1/s3] terraform: 
01:27:00.785 INFO   [management-account/eu-west-1/s3] terraform: Successfully configured the backend "s3"! Terraform will automatically
01:27:00.785 INFO   [management-account/eu-west-1/s3] terraform: use this backend unless the backend configuration changes.
01:27:00.795 INFO   [management-account/global-infra/organization-accounts] terraform: 
01:27:00.795 INFO   [management-account/global-infra/organization-accounts] terraform: Successfully configured the backend "s3"! Terraform will automatically
01:27:00.795 INFO   [management-account/global-infra/organization-accounts] terraform: use this backend unless the backend configuration changes.
01:27:00.818 INFO   [playground-account/eu-west-1/s3] terraform: 
01:27:00.818 INFO   [playground-account/eu-west-1/s3] terraform: Successfully configured the backend "s3"! Terraform will automatically
01:27:00.818 INFO   [playground-account/eu-west-1/s3] terraform: use this backend unless the backend configuration changes.
01:27:00.835 INFO   [test-account/eu-west-1/s3] terraform: 
01:27:00.835 INFO   [test-account/eu-west-1/s3] terraform: Successfully configured the backend "s3"! Terraform will automatically
01:27:00.835 INFO   [test-account/eu-west-1/s3] terraform: use this backend unless the backend configuration changes.
01:27:01.145 INFO   [management-account/eu-west-1/s3] terraform: Initializing provider plugins...
01:27:01.145 INFO   [management-account/eu-west-1/s3] terraform: - Finding latest version of hashicorp/aws...
01:27:01.189 INFO   [playground-account/eu-west-1/s3] terraform: Initializing provider plugins...
01:27:01.189 INFO   [playground-account/eu-west-1/s3] terraform: - Finding latest version of hashicorp/aws...
01:27:01.204 INFO   [management-account/global-infra/organization-accounts] terraform: Initializing provider plugins...
01:27:01.204 INFO   [management-account/global-infra/organization-accounts] terraform: - Finding latest version of hashicorp/aws...
01:27:01.214 INFO   [test-account/eu-west-1/s3] terraform: Initializing provider plugins...
01:27:01.214 INFO   [test-account/eu-west-1/s3] terraform: - Finding latest version of hashicorp/aws...
01:27:01.644 INFO   [playground-account/eu-west-1/s3] terraform: - Installing hashicorp/aws v6.0.0...
01:27:01.670 INFO   [management-account/eu-west-1/s3] terraform: - Installing hashicorp/aws v6.0.0...
01:27:01.776 INFO   [management-account/global-infra/organization-accounts] terraform: - Installing hashicorp/aws v6.0.0...
01:27:02.013 INFO   [test-account/eu-west-1/s3] terraform: - Installing hashicorp/aws v6.0.0...
01:27:08.297 INFO   [playground-account/eu-west-1/s3] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
01:27:08.297 INFO   [playground-account/eu-west-1/s3] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
01:27:08.297 INFO   [playground-account/eu-west-1/s3] terraform: selections it made above. Include this file in your version control repository
01:27:08.297 INFO   [playground-account/eu-west-1/s3] terraform: so that Terraform can guarantee to make the same selections by default when
01:27:08.297 INFO   [playground-account/eu-west-1/s3] terraform: you run "terraform init" in the future.
01:27:08.298 INFO   [playground-account/eu-west-1/s3] terraform: Terraform has been successfully initialized!
01:27:08.301 INFO   [management-account/eu-west-1/s3] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
01:27:08.304 INFO   [management-account/eu-west-1/s3] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
01:27:08.304 INFO   [management-account/eu-west-1/s3] terraform: selections it made above. Include this file in your version control repository
01:27:08.305 INFO   [management-account/eu-west-1/s3] terraform: so that Terraform can guarantee to make the same selections by default when
01:27:08.305 INFO   [management-account/eu-west-1/s3] terraform: you run "terraform init" in the future.
01:27:08.305 INFO   [management-account/eu-west-1/s3] terraform: Terraform has been successfully initialized!
01:27:08.501 INFO   [management-account/global-infra/organization-accounts] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
01:27:08.501 INFO   [management-account/global-infra/organization-accounts] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
01:27:08.502 INFO   [management-account/global-infra/organization-accounts] terraform: selections it made above. Include this file in your version control repository
01:27:08.502 INFO   [management-account/global-infra/organization-accounts] terraform: so that Terraform can guarantee to make the same selections by default when
01:27:08.502 INFO   [management-account/global-infra/organization-accounts] terraform: you run "terraform init" in the future.
01:27:08.594 INFO   [test-account/eu-west-1/s3] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
01:27:08.594 INFO   [test-account/eu-west-1/s3] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
01:27:08.594 INFO   [test-account/eu-west-1/s3] terraform: selections it made above. Include this file in your version control repository
01:27:08.594 INFO   [test-account/eu-west-1/s3] terraform: so that Terraform can guarantee to make the same selections by default when
01:27:08.594 INFO   [test-account/eu-west-1/s3] terraform: you run "terraform init" in the future.
01:27:08.650 INFO   [test-account/eu-west-1/s3] terraform: Terraform has been successfully initialized!
01:27:08.650 INFO   [management-account/global-infra/organization-accounts] terraform: Terraform has been successfully initialized!
01:27:14.172 STDOUT [management-account/eu-west-1/s3] terraform: aws_s3_bucket.this: Refreshing state... [id=ma-test-bucket-terragrunt-main-account]
01:27:14.488 STDOUT [management-account/global-infra/organization-accounts] terraform: aws_organizations_account.this: Refreshing state... [id=929864627295]
01:27:14.847 STDOUT [playground-account/eu-west-1/s3] terraform: aws_s3_bucket.this: Refreshing state... [id=ma-test-bucket-terragrunt]
01:27:15.133 STDOUT [test-account/eu-west-1/s3] terraform: aws_s3_bucket.this: Refreshing state... [id=ma-test-bucket-terragrunt-test-account]
01:27:15.152 STDOUT [management-account/global-infra/organization-accounts] terraform: No changes. Your infrastructure matches the configuration.
01:27:15.152 STDOUT [management-account/global-infra/organization-accounts] terraform: Terraform has compared your real infrastructure against your configuration
01:27:15.152 STDOUT [management-account/global-infra/organization-accounts] terraform: and found no differences, so no changes are needed.
01:27:16.257 STDOUT [management-account/eu-west-1/s3] terraform: Terraform used the selected providers to generate the following execution
01:27:16.257 STDOUT [management-account/eu-west-1/s3] terraform: plan. Resource actions are indicated with the following symbols:
01:27:16.257 STDOUT [management-account/eu-west-1/s3] terraform:   + create
01:27:16.257 STDOUT [management-account/eu-west-1/s3] terraform:   - destroy
01:27:16.257 STDOUT [management-account/eu-west-1/s3] terraform: Terraform will perform the following actions:
01:27:16.257 STDOUT [management-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this will be destroyed
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:   # (because resource uses count or for_each)
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:   - resource "aws_s3_bucket" "this" {
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:       - arn                         = "arn:aws:s3:::ma-test-bucket-terragrunt-main-account" -> null
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:       - bucket                      = "ma-test-bucket-terragrunt-main-account" -> null
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:       - bucket_domain_name          = "ma-test-bucket-terragrunt-main-account.s3.amazonaws.com" -> null
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:       - bucket_region               = "eu-west-1" -> null
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:       - bucket_regional_domain_name = "ma-test-bucket-terragrunt-main-account.s3.eu-west-1.amazonaws.com" -> null
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:       - force_destroy               = false -> null
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:       - hosted_zone_id              = "Z1BKCTXD74EZPE" -> null
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:       - id                          = "ma-test-bucket-terragrunt-main-account" -> null
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:       - object_lock_enabled         = false -> null
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:       - region                      = "eu-west-1" -> null
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:       - request_payer               = "BucketOwner" -> null
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:       - tags                        = {
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:           - "Environment" = "test-env"
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:           - "Name"        = "ma-test-bucket-tag"
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:         } -> null
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:       - tags_all                    = {
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:           - "Environment" = "test-env"
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:           - "Name"        = "ma-test-bucket-tag"
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:         } -> null
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:         # (3 unchanged attributes hidden)
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:       - grant {
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:           - id          = "fb3a504c2c3b80cce97fc2bdc3b54f23c6a053294b59038773062668af2c2a6f" -> null
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:           - permissions = [
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:               - "FULL_CONTROL",
01:27:16.258 STDOUT [management-account/eu-west-1/s3] terraform:             ] -> null
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:           - type        = "CanonicalUser" -> null
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:             # (1 unchanged attribute hidden)
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:         }
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:       - server_side_encryption_configuration {
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:           - rule {
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:               - bucket_key_enabled = false -> null
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:               - apply_server_side_encryption_by_default {
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:                   - sse_algorithm     = "AES256" -> null
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:                     # (1 unchanged attribute hidden)
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:                 }
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:             }
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:         }
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:       - versioning {
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:           - enabled    = false -> null
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:           - mfa_delete = false -> null
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:         }
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:     }
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this["ma-test-bucket-terragrunt-main-account"] will be created
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:   + resource "aws_s3_bucket" "this" {
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:       + acceleration_status         = (known after apply)
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:       + acl                         = (known after apply)
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:       + arn                         = (known after apply)
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:       + bucket                      = "ma-test-bucket-terragrunt-main-account"
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:       + bucket_domain_name          = (known after apply)
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:       + bucket_prefix               = (known after apply)
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:       + bucket_region               = (known after apply)
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:       + bucket_regional_domain_name = (known after apply)
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:       + force_destroy               = false
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:       + hosted_zone_id              = (known after apply)
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:       + id                          = (known after apply)
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:       + object_lock_enabled         = (known after apply)
01:27:16.259 STDOUT [management-account/eu-west-1/s3] terraform:       + policy                      = (known after apply)
01:27:16.260 STDOUT [management-account/eu-west-1/s3] terraform:       + region                      = "eu-west-1"
01:27:16.260 STDOUT [management-account/eu-west-1/s3] terraform:       + request_payer               = (known after apply)
01:27:16.260 STDOUT [management-account/eu-west-1/s3] terraform:       + tags                        = {
01:27:16.260 STDOUT [management-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
01:27:16.260 STDOUT [management-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag"
01:27:16.260 STDOUT [management-account/eu-west-1/s3] terraform:         }
01:27:16.260 STDOUT [management-account/eu-west-1/s3] terraform:       + tags_all                    = {
01:27:16.260 STDOUT [management-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
01:27:16.260 STDOUT [management-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag"
01:27:16.260 STDOUT [management-account/eu-west-1/s3] terraform:         }
01:27:16.260 STDOUT [management-account/eu-west-1/s3] terraform:       + website_domain              = (known after apply)
01:27:16.260 STDOUT [management-account/eu-west-1/s3] terraform:       + website_endpoint            = (known after apply)
01:27:16.260 STDOUT [management-account/eu-west-1/s3] terraform:       + cors_rule (known after apply)
01:27:16.260 STDOUT [management-account/eu-west-1/s3] terraform:       + grant (known after apply)
01:27:16.260 STDOUT [management-account/eu-west-1/s3] terraform:       + lifecycle_rule (known after apply)
01:27:16.260 STDOUT [management-account/eu-west-1/s3] terraform:       + logging (known after apply)
01:27:16.260 STDOUT [management-account/eu-west-1/s3] terraform:       + object_lock_configuration (known after apply)
01:27:16.260 STDOUT [management-account/eu-west-1/s3] terraform:       + replication_configuration (known after apply)
01:27:16.260 STDOUT [management-account/eu-west-1/s3] terraform:       + server_side_encryption_configuration (known after apply)
01:27:16.260 STDOUT [management-account/eu-west-1/s3] terraform:       + versioning (known after apply)
01:27:16.260 STDOUT [management-account/eu-west-1/s3] terraform:       + website (known after apply)
01:27:16.260 STDOUT [management-account/eu-west-1/s3] terraform:     }
01:27:16.260 STDOUT [management-account/eu-west-1/s3] terraform: Plan: 1 to add, 0 to change, 1 to destroy.
01:27:16.261 STDOUT [management-account/eu-west-1/s3] terraform: 
01:27:16.261 STDOUT [management-account/eu-west-1/s3] terraform: Changes to Outputs:
01:27:16.261 STDOUT [management-account/eu-west-1/s3] terraform:   ~ bucket_id = "ma-test-bucket-terragrunt-main-account" -> {
01:27:16.261 STDOUT [management-account/eu-west-1/s3] terraform:       + ma-test-bucket-terragrunt-main-account = (known after apply)
01:27:16.261 STDOUT [management-account/eu-west-1/s3] terraform:     }
01:27:16.981 STDOUT [playground-account/eu-west-1/s3] terraform: Terraform used the selected providers to generate the following execution
01:27:16.982 STDOUT [playground-account/eu-west-1/s3] terraform: plan. Resource actions are indicated with the following symbols:
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform:   + create
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform:   - destroy
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform: Terraform will perform the following actions:
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this will be destroyed
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform:   # (because resource uses count or for_each)
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform:   - resource "aws_s3_bucket" "this" {
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform:       - arn                         = "arn:aws:s3:::ma-test-bucket-terragrunt" -> null
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform:       - bucket                      = "ma-test-bucket-terragrunt" -> null
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform:       - bucket_domain_name          = "ma-test-bucket-terragrunt.s3.amazonaws.com" -> null
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform:       - bucket_region               = "eu-west-1" -> null
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform:       - bucket_regional_domain_name = "ma-test-bucket-terragrunt.s3.eu-west-1.amazonaws.com" -> null
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform:       - force_destroy               = false -> null
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform:       - hosted_zone_id              = "Z1BKCTXD74EZPE" -> null
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform:       - id                          = "ma-test-bucket-terragrunt" -> null
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform:       - object_lock_enabled         = false -> null
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform:       - region                      = "eu-west-1" -> null
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform:       - request_payer               = "BucketOwner" -> null
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform:       - tags                        = {
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform:           - "Environment" = "test-env"
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform:           - "Name"        = "ma-test-bucket-tag"
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform:         } -> null
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform:       - tags_all                    = {
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform:           - "Environment" = "test-env"
01:27:16.983 STDOUT [playground-account/eu-west-1/s3] terraform:           - "Name"        = "ma-test-bucket-tag"
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:         } -> null
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:         # (3 unchanged attributes hidden)
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:       - grant {
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:           - id          = "930454f06437e7fdb90b65c7ecea90969c129dcffb5f63020b02e1295aa3c04d" -> null
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:           - permissions = [
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:               - "FULL_CONTROL",
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:             ] -> null
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:           - type        = "CanonicalUser" -> null
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:             # (1 unchanged attribute hidden)
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:         }
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:       - server_side_encryption_configuration {
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:           - rule {
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:               - bucket_key_enabled = false -> null
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:               - apply_server_side_encryption_by_default {
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:                   - sse_algorithm     = "AES256" -> null
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:                     # (1 unchanged attribute hidden)
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:                 }
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:             }
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:         }
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:       - versioning {
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:           - enabled    = false -> null
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:           - mfa_delete = false -> null
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:         }
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:     }
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this["ma-bucket-one-altamash"] will be created
01:27:16.984 STDOUT [playground-account/eu-west-1/s3] terraform:   + resource "aws_s3_bucket" "this" {
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:       + acceleration_status         = (known after apply)
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:       + acl                         = (known after apply)
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:       + arn                         = (known after apply)
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket                      = "ma-bucket-one-altamash"
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_domain_name          = (known after apply)
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_prefix               = (known after apply)
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_region               = (known after apply)
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_regional_domain_name = (known after apply)
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:       + force_destroy               = false
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:       + hosted_zone_id              = (known after apply)
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:       + id                          = (known after apply)
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:       + object_lock_enabled         = (known after apply)
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:       + policy                      = (known after apply)
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:       + region                      = "eu-west-1"
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:       + request_payer               = (known after apply)
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:       + tags                        = {
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag"
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:         }
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:       + tags_all                    = {
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag"
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:         }
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:       + website_domain              = (known after apply)
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:       + website_endpoint            = (known after apply)
01:27:16.985 STDOUT [playground-account/eu-west-1/s3] terraform:       + cors_rule (known after apply)
01:27:16.986 STDOUT [playground-account/eu-west-1/s3] terraform:       + grant (known after apply)
01:27:16.986 STDOUT [playground-account/eu-west-1/s3] terraform:       + lifecycle_rule (known after apply)
01:27:16.986 STDOUT [playground-account/eu-west-1/s3] terraform:       + logging (known after apply)
01:27:16.986 STDOUT [playground-account/eu-west-1/s3] terraform:       + object_lock_configuration (known after apply)
01:27:16.986 STDOUT [playground-account/eu-west-1/s3] terraform:       + replication_configuration (known after apply)
01:27:16.986 STDOUT [playground-account/eu-west-1/s3] terraform:       + server_side_encryption_configuration (known after apply)
01:27:16.986 STDOUT [playground-account/eu-west-1/s3] terraform:       + versioning (known after apply)
01:27:16.986 STDOUT [playground-account/eu-west-1/s3] terraform:       + website (known after apply)
01:27:16.986 STDOUT [playground-account/eu-west-1/s3] terraform:     }
01:27:16.986 STDOUT [playground-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this["ma-bucket-two-altamash"] will be created
01:27:16.986 STDOUT [playground-account/eu-west-1/s3] terraform:   + resource "aws_s3_bucket" "this" {
01:27:16.986 STDOUT [playground-account/eu-west-1/s3] terraform:       + acceleration_status         = (known after apply)
01:27:16.986 STDOUT [playground-account/eu-west-1/s3] terraform:       + acl                         = (known after apply)
01:27:16.986 STDOUT [playground-account/eu-west-1/s3] terraform:       + arn                         = (known after apply)
01:27:16.986 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket                      = "ma-bucket-two-altamash"
01:27:16.986 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_domain_name          = (known after apply)
01:27:16.986 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_prefix               = (known after apply)
01:27:16.987 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_region               = (known after apply)
01:27:16.987 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_regional_domain_name = (known after apply)
01:27:16.987 STDOUT [playground-account/eu-west-1/s3] terraform:       + force_destroy               = false
01:27:16.987 STDOUT [playground-account/eu-west-1/s3] terraform:       + hosted_zone_id              = (known after apply)
01:27:16.987 STDOUT [playground-account/eu-west-1/s3] terraform:       + id                          = (known after apply)
01:27:16.987 STDOUT [playground-account/eu-west-1/s3] terraform:       + object_lock_enabled         = (known after apply)
01:27:16.987 STDOUT [playground-account/eu-west-1/s3] terraform:       + policy                      = (known after apply)
01:27:16.987 STDOUT [playground-account/eu-west-1/s3] terraform:       + region                      = "eu-west-1"
01:27:16.987 STDOUT [playground-account/eu-west-1/s3] terraform:       + request_payer               = (known after apply)
01:27:16.987 STDOUT [playground-account/eu-west-1/s3] terraform:       + tags                        = {
01:27:16.987 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
01:27:16.987 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag"
01:27:16.987 STDOUT [playground-account/eu-west-1/s3] terraform:         }
01:27:16.987 STDOUT [playground-account/eu-west-1/s3] terraform:       + tags_all                    = {
01:27:16.987 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
01:27:16.987 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag"
01:27:16.987 STDOUT [playground-account/eu-west-1/s3] terraform:         }
01:27:16.987 STDOUT [playground-account/eu-west-1/s3] terraform:       + website_domain              = (known after apply)
01:27:16.987 STDOUT [playground-account/eu-west-1/s3] terraform:       + website_endpoint            = (known after apply)
01:27:16.987 STDOUT [playground-account/eu-west-1/s3] terraform:       + cors_rule (known after apply)
01:27:16.988 STDOUT [playground-account/eu-west-1/s3] terraform:       + grant (known after apply)
01:27:16.988 STDOUT [playground-account/eu-west-1/s3] terraform:       + lifecycle_rule (known after apply)
01:27:16.988 STDOUT [playground-account/eu-west-1/s3] terraform:       + logging (known after apply)
01:27:16.988 STDOUT [playground-account/eu-west-1/s3] terraform:       + object_lock_configuration (known after apply)
01:27:16.988 STDOUT [playground-account/eu-west-1/s3] terraform:       + replication_configuration (known after apply)
01:27:16.988 STDOUT [playground-account/eu-west-1/s3] terraform:       + server_side_encryption_configuration (known after apply)
01:27:16.988 STDOUT [playground-account/eu-west-1/s3] terraform:       + versioning (known after apply)
01:27:16.988 STDOUT [playground-account/eu-west-1/s3] terraform:       + website (known after apply)
01:27:16.988 STDOUT [playground-account/eu-west-1/s3] terraform:     }
01:27:16.988 STDOUT [playground-account/eu-west-1/s3] terraform: Plan: 2 to add, 0 to change, 1 to destroy.
01:27:16.988 STDOUT [playground-account/eu-west-1/s3] terraform: 
01:27:16.988 STDOUT [playground-account/eu-west-1/s3] terraform: Changes to Outputs:
01:27:16.988 STDOUT [playground-account/eu-west-1/s3] terraform:   ~ bucket_id = "ma-test-bucket-terragrunt" -> {
01:27:16.988 STDOUT [playground-account/eu-west-1/s3] terraform:       + ma-bucket-one-altamash = (known after apply)
01:27:16.988 STDOUT [playground-account/eu-west-1/s3] terraform:       + ma-bucket-two-altamash = (known after apply)
01:27:16.988 STDOUT [playground-account/eu-west-1/s3] terraform:     }
01:27:17.244 STDOUT [test-account/eu-west-1/s3] terraform: Terraform used the selected providers to generate the following execution
01:27:17.244 STDOUT [test-account/eu-west-1/s3] terraform: plan. Resource actions are indicated with the following symbols:
01:27:17.244 STDOUT [test-account/eu-west-1/s3] terraform:   + create
01:27:17.244 STDOUT [test-account/eu-west-1/s3] terraform:   - destroy
01:27:17.244 STDOUT [test-account/eu-west-1/s3] terraform: Terraform will perform the following actions:
01:27:17.244 STDOUT [test-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this will be destroyed
01:27:17.244 STDOUT [test-account/eu-west-1/s3] terraform:   # (because resource uses count or for_each)
01:27:17.245 STDOUT [test-account/eu-west-1/s3] terraform:   - resource "aws_s3_bucket" "this" {
01:27:17.245 STDOUT [test-account/eu-west-1/s3] terraform:       - arn                         = "arn:aws:s3:::ma-test-bucket-terragrunt-test-account" -> null
01:27:17.245 STDOUT [test-account/eu-west-1/s3] terraform:       - bucket                      = "ma-test-bucket-terragrunt-test-account" -> null
01:27:17.245 STDOUT [test-account/eu-west-1/s3] terraform:       - bucket_domain_name          = "ma-test-bucket-terragrunt-test-account.s3.amazonaws.com" -> null
01:27:17.245 STDOUT [test-account/eu-west-1/s3] terraform:       - bucket_region               = "eu-west-1" -> null
01:27:17.245 STDOUT [test-account/eu-west-1/s3] terraform:       - bucket_regional_domain_name = "ma-test-bucket-terragrunt-test-account.s3.eu-west-1.amazonaws.com" -> null
01:27:17.245 STDOUT [test-account/eu-west-1/s3] terraform:       - force_destroy               = false -> null
01:27:17.245 STDOUT [test-account/eu-west-1/s3] terraform:       - hosted_zone_id              = "Z1BKCTXD74EZPE" -> null
01:27:17.245 STDOUT [test-account/eu-west-1/s3] terraform:       - id                          = "ma-test-bucket-terragrunt-test-account" -> null
01:27:17.245 STDOUT [test-account/eu-west-1/s3] terraform:       - object_lock_enabled         = false -> null
01:27:17.245 STDOUT [test-account/eu-west-1/s3] terraform:       - region                      = "eu-west-1" -> null
01:27:17.245 STDOUT [test-account/eu-west-1/s3] terraform:       - request_payer               = "BucketOwner" -> null
01:27:17.245 STDOUT [test-account/eu-west-1/s3] terraform:       - tags                        = {
01:27:17.245 STDOUT [test-account/eu-west-1/s3] terraform:           - "Environment" = "test-env"
01:27:17.245 STDOUT [test-account/eu-west-1/s3] terraform:           - "Name"        = "ma-test-bucket-tag-test-account"
01:27:17.245 STDOUT [test-account/eu-west-1/s3] terraform:         } -> null
01:27:17.245 STDOUT [test-account/eu-west-1/s3] terraform:       - tags_all                    = {
01:27:17.245 STDOUT [test-account/eu-west-1/s3] terraform:           - "Environment" = "test-env"
01:27:17.245 STDOUT [test-account/eu-west-1/s3] terraform:           - "Name"        = "ma-test-bucket-tag-test-account"
01:27:17.245 STDOUT [test-account/eu-west-1/s3] terraform:         } -> null
01:27:17.245 STDOUT [test-account/eu-west-1/s3] terraform:         # (3 unchanged attributes hidden)
01:27:17.245 STDOUT [test-account/eu-west-1/s3] terraform:       - grant {
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:           - id          = "52a4785162cb6f9cec841c46fb038426825896161cb6a9172f58b765693d29a4" -> null
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:           - permissions = [
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:               - "FULL_CONTROL",
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:             ] -> null
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:           - type        = "CanonicalUser" -> null
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:             # (1 unchanged attribute hidden)
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:         }
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:       - server_side_encryption_configuration {
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:           - rule {
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:               - bucket_key_enabled = false -> null
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:               - apply_server_side_encryption_by_default {
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:                   - sse_algorithm     = "AES256" -> null
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:                     # (1 unchanged attribute hidden)
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:                 }
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:             }
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:         }
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:       - versioning {
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:           - enabled    = false -> null
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:           - mfa_delete = false -> null
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:         }
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:     }
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this["ma-test-bucket-terragrunt-test-account"] will be created
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:   + resource "aws_s3_bucket" "this" {
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:       + acceleration_status         = (known after apply)
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:       + acl                         = (known after apply)
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:       + arn                         = (known after apply)
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:       + bucket                      = "ma-test-bucket-terragrunt-test-account"
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:       + bucket_domain_name          = (known after apply)
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:       + bucket_prefix               = (known after apply)
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:       + bucket_region               = (known after apply)
01:27:17.246 STDOUT [test-account/eu-west-1/s3] terraform:       + bucket_regional_domain_name = (known after apply)
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:       + force_destroy               = false
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:       + hosted_zone_id              = (known after apply)
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:       + id                          = (known after apply)
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:       + object_lock_enabled         = (known after apply)
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:       + policy                      = (known after apply)
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:       + region                      = "eu-west-1"
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:       + request_payer               = (known after apply)
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:       + tags                        = {
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag-test-account"
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:         }
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:       + tags_all                    = {
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag-test-account"
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:         }
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:       + website_domain              = (known after apply)
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:       + website_endpoint            = (known after apply)
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:       + cors_rule (known after apply)
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:       + grant (known after apply)
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:       + lifecycle_rule (known after apply)
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:       + logging (known after apply)
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:       + object_lock_configuration (known after apply)
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:       + replication_configuration (known after apply)
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:       + server_side_encryption_configuration (known after apply)
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:       + versioning (known after apply)
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:       + website (known after apply)
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:     }
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform: Plan: 1 to add, 0 to change, 1 to destroy.
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform: 
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform: Changes to Outputs:
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:   ~ bucket_id = "ma-test-bucket-terragrunt-test-account" -> {
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:       + ma-test-bucket-terragrunt-test-account = (known after apply)
01:27:17.247 STDOUT [test-account/eu-west-1/s3] terraform:     }
```

</details>
    
